
#Область ПрограммныйИнтерфейс

Процедура ПереключитьРежимРедактораТекста(Форма) Экспорт
	
	// Переключение редактора в другой режим
	РежимРедактирования = НЕ Форма["РежимРедактора_Markdown"];
	Форма["РежимРедактора_Markdown"] = РежимРедактирования;
	
	Элементы = Форма.Элементы;
	Элементы["КнопкаПереключенияРежимаРедактора_Markdown"].Пометка = НЕ РежимРедактирования;
	
	Если РежимРедактирования Тогда
		Форма["СодержимоеHTML_Markdown"] = "";
	Иначе
		Форма["СодержимоеHTML_Markdown"] = РедакторMarkdownВызовСервера.MarkdownToHTML(
			Форма["ТекстовоеСодержимое_Markdown"]);
	КонецЕсли;
	
	// Управление видимостью редактора и просмотрщика
	Элементы.ТекстовыйРедактор_Markdown.Видимость  = РежимРедактирования;
	Элементы.ПросмотрРезультата_Markdown.Видимость = НЕ РежимРедактирования;	
	
КонецПроцедуры

#КонецОбласти